       IDENTIFICATION DIVISION.
           PROGRAM-ID. cupidon.
           AUTHOR. cupidonTeam.

       DATA DIVISION.
           WORKING-STORAGE SECTION.
           

       PROCEDURE DIVISION.
           main.
               STOP RUN.
       END PROGRAM cupidon.